go-profiling-toolchain/e3-spike/output/hey-fast-part3.log

Summary:
  Total:	30.0015 secs
  Slowest:	0.0147 secs
  Fastest:	0.0001 secs
  Average:	0.0015 secs
  Requests/sec:	44737.6516
  
  Total data:	4026594 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [992618]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [6852]	|
  0.004 [426]	|
  0.006 [44]	|
  0.007 [2]	|
  0.009 [8]	|
  0.010 [28]	|
  0.012 [17]	|
  0.013 [0]	|
  0.015 [4]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0011 secs
  75%% in 0.0012 secs
  90%% in 0.0012 secs
  95%% in 0.0012 secs
  99%% in 0.0014 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0075 secs
  resp wait:	0.0015 secs, 0.0001 secs, 0.0146 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0112 secs

Status code distribution:
  [200]	1000000 responses