go-profiling-toolchain/e3-spike/output/hey-fast.log

Summary:
  Total:	30.0009 secs
  Slowest:	0.0307 secs
  Fastest:	0.0001 secs
  Average:	0.0015 secs
  Requests/sec:	44791.8268
  
  Total data:	4031385 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [999048]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [829]	|
  0.009 [48]	|
  0.012 [24]	|
  0.015 [47]	|
  0.018 [0]	|
  0.022 [1]	|
  0.025 [0]	|
  0.028 [0]	|
  0.031 [2]	|


Latency distribution:
  10%% in 0.0009 secs
  25%% in 0.0010 secs
  50%% in 0.0011 secs
  75%% in 0.0012 secs
  90%% in 0.0012 secs
  95%% in 0.0013 secs
  99%% in 0.0018 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0083 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0097 secs
  resp wait:	0.0015 secs, 0.0001 secs, 0.0307 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0060 secs

Status code distribution:
  [200]	1000000 responses