go-profiling-toolchain/e3-spike/output/hey-slow-part3.log

Summary:
  Total:	30.0021 secs
  Slowest:	0.2227 secs
  Fastest:	0.0001 secs
  Average:	0.0195 secs
  Requests/sec:	9.0994
  
  Total data:	819 bytes
  Size/request:	3 bytes

Response time histogram:
  0.000 [1]	|
  0.022 [249]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [0]	|
  0.067 [0]	|
  0.089 [0]	|
  0.111 [0]	|
  0.134 [0]	|
  0.156 [0]	|
  0.178 [0]	|
  0.200 [0]	|
  0.223 [23]	|■■■■


Latency distribution:
  10%% in 0.0011 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0012 secs
  90%% in 0.0014 secs
  95%% in 0.2186 secs
  99%% in 0.2202 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	0.0195 secs, 0.0001 secs, 0.2227 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	273 responses