go-profiling-toolchain/e3-spike/output/hey-slow.log

Summary:
  Total:	30.0011 secs
  Slowest:	0.3825 secs
  Fastest:	0.0001 secs
  Average:	0.0200 secs
  Requests/sec:	8.9663
  
  Total data:	807 bytes
  Size/request:	3 bytes

Response time histogram:
  0.000 [1]	|
  0.038 [249]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.077 [0]	|
  0.115 [0]	|
  0.153 [0]	|
  0.191 [0]	|
  0.230 [6]	|■
  0.268 [5]	|■
  0.306 [5]	|■
  0.344 [0]	|
  0.382 [3]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0012 secs
  90%% in 0.0013 secs
  95%% in 0.2302 secs
  99%% in 0.3702 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	0.0199 secs, 0.0001 secs, 0.3824 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	269 responses